tests/fixtures/external_workflows/make_payment/2021-01-11_product_id_3942467_11482_cent_payment.json

[
  {
    "name": "make_payment",
    "state": {
      "product_type": "loan",
      "product_id": 3942467,
      "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "steps": [
        "apply_to_future_installments"
      ],
      "actions": [],
      "session_type_rank": 1,
      "errors": [],
      "originally_late": "false"
    },
    "json_output": {
      "uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "name": "make_payment",
      "opts": {
        "multipart": false
      },
      "state": {
        "product_type": "loan",
        "product_id": 3942467,
        "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
        "steps": [
          "apply_to_future_installments"
        ],
        "actions": [],
        "session_type_rank": 1,
        "errors": [],
        "originally_late": "false"
      },
      "step": {
        "event": null,
        "name": "apply_to_future_installments",
        "opts": {},
        "script": "audio:product/make_payment/_payment_for_installment,date:01252021",
        "error": null,
        "inputs": [],
        "errors": [],
        "actions": [
          {
            "displayName": "Yes",
            "name": "yes",
            "opts": {
              "action_type": "yes"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          },
          {
            "displayName": "No",
            "name": "no",
            "opts": {
              "action_type": "no"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": true
          }
        ],
        "action_to_emphasize": null,
        "authenticity_token": "",
        "uuid": "102ff1b3-2dc5-4852-8ca3-af632d3df309"
      }
    }
  },
  {
    "name": "make_payment",
    "state": {
      "product_type": "loan",
      "product_id": 3942467,
      "steps": [
        "apply_to_future_installments",
        "pay_with_bank_account_on_file"
      ],
      "actions": [
        "yes"
      ],
      "step_action": "yes",
      "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "session_type_rank": 1,
      "originally_late": "false",
      "errors": [],
      "apply_to_future_installments": "true"
    },
    "json_output": {
      "uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "name": "make_payment",
      "opts": {
        "multipart": false
      },
      "state": {
        "product_type": "loan",
        "product_id": 3942467,
        "steps": [
          "apply_to_future_installments",
          "pay_with_bank_account_on_file"
        ],
        "actions": [
          "yes"
        ],
        "step_action": "yes",
        "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
        "session_type_rank": 1,
        "originally_late": "false",
        "errors": [],
        "apply_to_future_installments": "true"
      },
      "step": {
        "event": null,
        "name": "pay_with_bank_account_on_file",
        "opts": {},
        "script": "audio:product/make_payment/_use_bank_account_on_file",
        "error": null,
        "inputs": [],
        "errors": [],
        "actions": [
          {
            "displayName": "Yes",
            "name": "yes",
            "opts": {
              "action_type": "yes"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          },
          {
            "displayName": "No",
            "name": "no",
            "opts": {
              "action_type": "no"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          }
        ],
        "action_to_emphasize": null,
        "authenticity_token": "",
        "uuid": "b4d58ea5-2cda-4150-821e-c6e75c5f69f3"
      }
    }
  },
  {
    "name": "make_payment",
    "state": {
      "product_type": "loan",
      "product_id": 3942467,
      "apply_to_future_installments": "true",
      "steps": [
        "apply_to_future_installments",
        "pay_with_bank_account_on_file",
        "pay_on_earliest_date"
      ],
      "actions": [
        "yes",
        "yes"
      ],
      "step_action": "yes",
      "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "session_type_rank": 1,
      "originally_late": "false",
      "errors": [],
      "method": "ach"
    },
    "json_output": {
      "uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "name": "make_payment",
      "opts": {
        "multipart": false
      },
      "state": {
        "product_type": "loan",
        "product_id": 3942467,
        "apply_to_future_installments": "true",
        "steps": [
          "apply_to_future_installments",
          "pay_with_bank_account_on_file",
          "pay_on_earliest_date"
        ],
        "actions": [
          "yes",
          "yes"
        ],
        "step_action": "yes",
        "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
        "session_type_rank": 1,
        "originally_late": "false",
        "errors": [],
        "method": "ach"
      },
      "step": {
        "event": null,
        "name": "pay_on_earliest_date",
        "opts": {},
        "script": "audio:product/make_payment/_schedule_this_payment_for,date:01112021",
        "error": null,
        "inputs": [],
        "errors": [],
        "actions": [
          {
            "displayName": "Yes",
            "name": "yes",
            "opts": {
              "action_type": "yes"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          },
          {
            "displayName": "No",
            "name": "no",
            "opts": {
              "action_type": "no"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          }
        ],
        "action_to_emphasize": null,
        "authenticity_token": "",
        "uuid": "e0affe86-6ee7-4b54-8efb-92b4bada2666"
      }
    }
  },
  {
    "name": "make_payment",
    "state": {
      "product_type": "loan",
      "product_id": 3942467,
      "method": "ach",
      "apply_to_future_installments": "true",
      "steps": [
        "apply_to_future_installments",
        "pay_with_bank_account_on_file",
        "pay_on_earliest_date",
        "pay_amount_due"
      ],
      "actions": [
        "yes",
        "yes",
        "yes"
      ],
      "step_action": "yes",
      "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "session_type_rank": 1,
      "originally_late": "false",
      "errors": [],
      "date": "2021-01-11"
    },
    "json_output": {
      "uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "name": "make_payment",
      "opts": {
        "multipart": false
      },
      "state": {
        "product_type": "loan",
        "product_id": 3942467,
        "method": "ach",
        "apply_to_future_installments": "true",
        "steps": [
          "apply_to_future_installments",
          "pay_with_bank_account_on_file",
          "pay_on_earliest_date",
          "pay_amount_due"
        ],
        "actions": [
          "yes",
          "yes",
          "yes"
        ],
        "step_action": "yes",
        "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
        "session_type_rank": 1,
        "originally_late": "false",
        "errors": [],
        "date": "2021-01-11"
      },
      "step": {
        "event": null,
        "name": "pay_amount_due",
        "opts": {},
        "script": "audio:product/make_payment/_next_payment_amount_is,currency:114.82,audio:product/make_payment/_pay_that_amount",
        "error": null,
        "inputs": [],
        "errors": [],
        "actions": [
          {
            "displayName": "Yes",
            "name": "yes",
            "opts": {
              "action_type": "yes"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          },
          {
            "displayName": "No",
            "name": "no",
            "opts": {
              "action_type": "no"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          }
        ],
        "action_to_emphasize": null,
        "authenticity_token": "",
        "uuid": "5d09602d-4e0a-41ca-8353-eeaf4e3de52d"
      }
    }
  },
  {
    "name": "make_payment",
    "state": {
      "product_type": "loan",
      "product_id": 3942467,
      "method": "ach",
      "date": "2021-01-11",
      "apply_to_future_installments": "true",
      "steps": [
        "apply_to_future_installments",
        "pay_with_bank_account_on_file",
        "pay_on_earliest_date",
        "pay_amount_due",
        "confirmation"
      ],
      "actions": [
        "yes",
        "yes",
        "yes",
        "yes"
      ],
      "step_action": "yes",
      "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "session_type_rank": 1,
      "originally_late": "false",
      "errors": [],
      "amount": "114.82"
    },
    "json_output": {
      "uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "name": "make_payment",
      "opts": {
        "multipart": false
      },
      "state": {
        "product_type": "loan",
        "product_id": 3942467,
        "method": "ach",
        "date": "2021-01-11",
        "apply_to_future_installments": "true",
        "steps": [
          "apply_to_future_installments",
          "pay_with_bank_account_on_file",
          "pay_on_earliest_date",
          "pay_amount_due",
          "confirmation"
        ],
        "actions": [
          "yes",
          "yes",
          "yes",
          "yes"
        ],
        "step_action": "yes",
        "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
        "session_type_rank": 1,
        "originally_late": "false",
        "errors": [],
        "amount": "114.82"
      },
      "step": {
        "event": null,
        "name": "confirmation",
        "opts": {},
        "script": "audio:product/make_payment/_authorizing,audio:shared/_ivr,audio:shared/_account_servicer,audio:shared/_one_time_ach_debit,audio:shared/_account_ending_in,digits:8546,audio:shared/_for,currency:114.82,audio:shared/_on,date:01112021,audio:product/make_payment/_also_authorizing,audio:shared/_Iivr,audio:shared/_account_servicer,audio:product/make_payment/_confirmation_email",
        "error": null,
        "inputs": [],
        "errors": [],
        "actions": [
          {
            "displayName": "I agree",
            "name": "i_agree",
            "opts": {
              "action_type": "authorize"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          },
          {
            "displayName": "Cancel",
            "name": "cancel",
            "opts": {
              "action_type": "cancel"
            },
            "isFinish": false,
            "emphasized": null,
            "secondary": null
          }
        ],
        "action_to_emphasize": null,
        "authenticity_token": "",
        "uuid": "c0e0b43a-b1e5-4087-9f83-e8ac769ed0de"
      }
    }
  },
  {
    "name": "make_payment",
    "state": {
      "product_type": "loan",
      "product_id": 3942467,
      "amount": "114.82",
      "method": "ach",
      "date": "2021-01-11",
      "apply_to_future_installments": "true",
      "steps": [
        "apply_to_future_installments",
        "pay_with_bank_account_on_file",
        "pay_on_earliest_date",
        "pay_amount_due",
        "confirmation",
        "end"
      ],
      "actions": [
        "yes",
        "yes",
        "yes",
        "yes",
        "i_agree"
      ],
      "step_action": "i_agree",
      "session_uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "session_type_rank": 1,
      "originally_late": "false",
      "errors": []
    },
    "json_output": {
      "uuid": "803f4b4c-057d-4438-a39f-0e1072f3c88a",
      "name": "make_payment",
      "opts": {
        "multipart": false
      },
      "state": {
        "product_type": "loan",
        "product_id": 3050541,
        "amount": "114.82",
        "method": "ach",
        "date": "2021-01-07",
        "steps": [
          "pay_with_bank_account_on_file",
          "pay_amount_due",
          "pay_on_earliest_date",
          "confirmation",
          "end"
        ],
        "actions": [
          "yes",
          "yes",
          "yes",
          "i_agree"
        ],
        "step_action": "i_agree",
        "session_uuid": "b56fcf83-8e09-4cb6-8981-14a13857ee08",
        "session_type_rank": 1,
        "originally_late": "true",
        "errors": []
      },
      "step": {
        "event": null,
        "name": "end",
        "opts": {
          "end_button_text": {}
        },
        "script": "audio:product/make_payment/_payment_thank_you,currency:114.82,audio:product/make_payment/_authorized_on,date:01112021,audio:product/make_payment/_questions_please_call,phone:8007125407",
        "error": null,
        "inputs": [],
        "errors": [],
        "actions": [
          {
            "displayName": "Finish",
            "name": "finish",
            "isFinish": true,
            "opts": {}
          }
        ],
        "action_to_emphasize": null,
        "authenticity_token": "",
        "uuid": "6c775776-d65e-469f-9b3d-2c3f91542895"
      }
    }
  }
]